#+TITLE: Podcast Database
#+AUTHOR: Martín Alsinet
#+DATE: 2019
#+OPTIONS: ^:nil num:nil ':t
#+LANGUAGE: es
#+PROPERTY: header-args:python :python python-3.6 :results output drawer :mkdirp yes
#+PROPERTY: header-args:sh :results raw drawer
#+TODO: TODO DOING | DONE

** Literate Programming

Para escribir este documento estoy usando [[https://www.gnu.org/software/emacs][Emacs]] y [[https://orgmode.org][Org mode]], que es un modo de Emacs que tiene funcionalidades para literate programming.

La idea de la programación literaria consiste en que el código fuente de la aplicación sale de la documentación. Esto quiere decir que para poder generar un ejecutable (un /build/) de una aplicación hecha "literariamente" es necesario procesar la documentación, extraer de ella los fragmentos de código fuente que la constituyen (en org-mode este proceso se denomina /tangle/) y luego generar el ejecutable correspondiente con ese código.

En nuestro caso, la documentación a procesar es /este documento/. Todo el código fuente de la aplicación está contenido en este documento, dentro de los fragmentos de código delimitados por las etiquetas =#+begin_src= y =#+end_src=. Los bloques de código que tienen el parámetro =:tangle path/to/file= en el tag de inicio son exportados al archivo que indica el path. De esta manera, podemos generar todos los archivos del código fuente de la aplicación /tangleando/ la documentación. El comando =org-babel-tangle= dispara la generación de los archivos en cualquier momento.

El hecho de generar el código fuente desde este documento permite que no sea necesario guardarlo en el repositorio. Cada vez que es necesario ejecutar la aplicación, o generar un build para una versión determinada, se exporta el código fuente desde este documento. Como podemos ver usando el comando =git ls-tree=, los únicos archivos que están comiteados en el repositorio son el =.gitignore=, =LICENSE= y =podcast-db.org= (este archivo). El archivo =README.org= es un link simbólico a =podcast-db.org= para que aparezca como índice en github.

#+begin_src sh
# listar los archivos comiteados en el repositorio
git ls-tree --full-tree -r --name-only HEAD
#+end_src

#+RESULTS:
:results:
.gitignore
README.org
podcast-db.org
:end:

*** CLI script

Generamos un script =./podcast-db= que será la interface desde línea de comandos con la aplicación, parseando los parámetros recibidos y ejecutando las acciones correspondientes.

#+begin_src python :tangle podcast-db :tangle-mode (identity #o755)
#!/usr/bin/env python-3.6
from cli.arguments import argument_tuples, parser_from_tuples

tuples = argument_tuples()
parser = parser_from_tuples(tuples)
parser.description = "Query podcasts and episodes from France Inter"
args = parser.parse_args(["--help"])

print(args)
#+end_src

#+RESULTS:
:results:
usage:  [-h] [-v] [--source SOURCE] [--podcast PODCAST] [--episode EPISODE]
        [--keyword KEYWORD] [--year YEAR] [--month MONTH]
        command

Query podcasts and episodes from France Inter

positional arguments:
  command            list-sources | list-podcasts | list-episodes | show-
                     podcast | show-episode

optional arguments:
  -h, --help         show this help message and exit
  -v , --version     show version
  --source SOURCE    source name or code ('franceinter' or 'fri')
  --podcast PODCAST  podcast identifier string ('sur-les-epaules')
  --episode EPISODE  episode date in YYYY-MM-DD format ('2018-04-17')
  --keyword KEYWORD  filter list by keyword ('musique')
  --year YEAR        filter list by year ('2018')
  --month MONTH      filter list by month ('2018-03')
:end:

**** Obtener el listado de los podcasts de France Inter

#+begin_src python
import itertools
import requests
import requests_cache
from franceinter.podcasts import podcasts_from_url

requests_cache.install_cache()

url = "https://www.franceinter.fr/emissions/"
podcasts = podcasts_from_url(url)
first_five = itertools.islice(podcasts, 5)
for podcast in first_five:
    print(podcast)
    print("\n")
#+end_src

#+RESULTS:
:results:
Podcast(title='1001 mondes', url='https://www.franceinter.fr/emissions/mille-et-un-mondes')


Podcast(title='116 rue Albert-Londres', url='https://www.franceinter.fr/emissions/116-rue-albert-londres')


Podcast(title='18 bis, boulevard Hache-Coeur', url='https://www.franceinter.fr/emissions/18-bis-boulevard-hache-coeur')


Podcast(title='1914/1918 : la grande guerre, cent ans après', url='https://www.franceinter.fr/emissions/1914-1918-la-grande-guerre-cent-ans-apres')


Podcast(title='1918, un monde en révolutions', url='https://www.franceinter.fr/emissions/1918-un-monde-en-revolutions')


:end:

**** Para cada podcast obtener el nombre, el url y el autor

#+begin_src python
import itertools
import requests
import requests_cache
from franceinter.podcasts import podcasts_from_url

requests_cache.install_cache()

url = "https://www.franceinter.fr/emissions/"
podcasts = podcasts_from_url(url)
first_five = list(itertools.islice(podcasts, 5))
first = first_five[0]
print(" Podcast title: " + first.title)
print("   Podcast URL: " + first.url)
print("Podcast author: " + first.author)
#+end_src

#+RESULTS:
:results:
 Podcast title: 1001 mondes
   Podcast URL: https://www.franceinter.fr/emissions/mille-et-un-mondes
Podcast author: Laura El Makki
:end:

**** Filtrar el listado de podcasts por una palabra clave

#+begin_src python
import itertools
import requests
import requests_cache
from franceinter.podcasts import podcasts_from_url, podcasts_with_keyword

requests_cache.install_cache()

url = "https://www.franceinter.fr/emissions/"
podcasts = podcasts_from_url(url)
music_podcasts = podcasts_with_keyword(podcasts, "musique")
first_five = itertools.islice(music_podcasts, 5)
for podcast in first_five:
    print(podcast)
    print("\n")
#+end_src

#+RESULTS:
:results:
Podcast(title='Je veux de la musique !', url='https://www.franceinter.fr/emissions/je-veux-de-la-musique')


Podcast(title='Michel Berger, tout pour la musique', url='https://www.franceinter.fr/emissions/michel-berger-tout-pour-la-musique')


Podcast(title='La musique d'Inter', url='https://www.franceinter.fr/emissions/la-musique-d-inter')


Podcast(title='On parle musique', url='https://www.franceinter.fr/emissions/parle-musique')


Podcast(title='Quand la musique donne (été 2012)', url='https://www.franceinter.fr/emissions/quand-la-musique-donne-ete-2012')


:end:

**** Asignarle un identificador a cada podcast

Realizamos una [[#podcast-id-poc][prueba de concepto]] para determinar si se puede utilizar la frecuencia de las palabras que componen el título y el autor para asignarle un identificador único a cada podcast que no sea un código difícil de recordar. Encontramos que casi la mitad de los podcasts no tienen una palabra única que se pueda usar como identificador.

Pensando un poco encontramos una alternativa mejor, teniendo en cuenta que URL es una propiedad única de cada podcast, dado que dos podcasts no pueden tener el mismo URL. En el caso de France Inter, la parte única del URL de cada podcast es lo que le sigue a =https://www.franceinter.fr/emissions/=.

Vamos a usar la parte única del URL para identificar al podcast, agregándole una propiedad =identifier= a la clase =franceinter.podcasts.Podcast= que extrae el identificador desde el URL.

#+begin_src python
import itertools
import requests
import requests_cache
from franceinter.podcasts import podcasts_from_url

requests_cache.install_cache()

url = "https://www.franceinter.fr/emissions/"
podcasts = podcasts_from_url(url)
first_five = list(itertools.islice(podcasts, 5))
for podcast in first_five:
    print(" Podcast title: " + podcast.title)
    print("   Podcast URL: " + podcast.url)
    print("Podcast author: " + podcast.author)
    print("    Podcast ID: " + podcast.identifier)
    print("\n")
#+end_src

#+RESULTS:
:results:
 Podcast title: 1001 mondes
   Podcast URL: https://www.franceinter.fr/emissions/mille-et-un-mondes
Podcast author: Laura El Makki
    Podcast ID: mille-et-un-mondes


 Podcast title: 116 rue Albert-Londres
   Podcast URL: https://www.franceinter.fr/emissions/116-rue-albert-londres
Podcast author: Alexandre Héraud
    Podcast ID: 116-rue-albert-londres


 Podcast title: 18 bis, boulevard Hache-Coeur
   Podcast URL: https://www.franceinter.fr/emissions/18-bis-boulevard-hache-coeur
Podcast author: Frédéric Pommier
    Podcast ID: 18-bis-boulevard-hache-coeur


 Podcast title: 1914/1918 : la grande guerre, cent ans après
   Podcast URL: https://www.franceinter.fr/emissions/1914-1918-la-grande-guerre-cent-ans-apres
Podcast author: 
    Podcast ID: 1914-1918-la-grande-guerre-cent-ans-apres


 Podcast title: 1918, un monde en révolutions
   Podcast URL: https://www.franceinter.fr/emissions/1918-un-monde-en-revolutions
Podcast author: Ali Baddou
    Podcast ID: 1918-un-monde-en-revolutions


:end:

**** 3. Ejemplos

- Una respuesta válida, con el HTML de la página del listado de podcasts
- Una respuesta inválida, que no es de la clase =requests.model.Response=
- Una respuesta válida, pero que tiene el HTML de otra página

#+begin_src python :tangle franceinter/podcasts/tests/examples_podcasts_from_response.py
from requests.models import Response

def response_ok():
    resp = Response()
    resp.status_code = 200
    filename = "./franceinter/html/podcast-list-short.html" 
    with open(filename, "rb") as f:
        resp._content = f.read()
    return resp

def invalid_response():
    return "i am not a Response"

def wrong_page_response():
    resp = Response()
    resp.status_code = 200
    filename = "./franceinter/html/wrong-page.html" 
    with open(filename, "rb") as f:
        resp._content = f.read()
    return resp

#+end_src

#+RESULTS:
:results:
:end:

**** 3. Ejemplos

- Caso exitoso, el tag tiene un =<span>= con la clase =rich-section-list-item-content-infos-author= que contiene un =<a>= con el atributo =title=
- El tag no tiene un =<span>=
- El tag tiene un =<span>=, pero éste no tiene un =<a>=
- El tag tiene un =<span>= que contiene un =<a>=, pero éste no tiene el atributo =title=

#+begin_src python :tangle franceinter/podcasts/tests/examples_author_from_tag.py
from bs4 import BeautifulSoup

def tag_with_author():
    html = '''<div>
<p>Lorem ipsum</p>
<span class="rich-section-list-item-content-infos-author">
<a title="William Shakespeare"></a>
</span>
    </div>'''
    soup = BeautifulSoup(html, "html.parser")
    tag = soup.div
    return tag

def tag_without_span():
    html = '''<div class="boldest">
Extremely bold
    </div>'''
    soup = BeautifulSoup(html, "html.parser")
    tag = soup.div
    return tag

def tag_without_link():
    html = '''<div>
<p>Lorem ipsum</p>
<span class="rich-section-list-item-content-infos-author">
<p title="William Shakespeare"></p>
</span>
    </div>'''
    soup = BeautifulSoup(html, "html.parser")
    tag = soup.div
    return tag

def tag_without_title():
    html = '''<div>
<p>Lorem ipsum</p>
<span class="rich-section-list-item-content-infos-author">
<a subtitle="William Shakespeare"></a>
</span>
    </div>'''
    soup = BeautifulSoup(html, "html.parser")
    tag = soup.div
    return tag

#+end_src

#+RESULTS:
:results:
True
:end:

**** 4. Boceto

#+begin_src python

def author_from_tag(tag):
    # validar que el tag sea un bs4.element.Tag
    # devuelve un string
    author = ""
    # hay que buscar un span con la clase "rich-section..."
    # si existe el span hay que buscar un a
    # si existe el a hay que revisar si tiene el atributo title
    # si tiene el atributo title se guarda en la variable author
    return author
    
#+end_src

#+RESULTS:
:results:
None
:end:

**** 6. Casos de prueba

- Caso exitoso, devuelve el autor
- Cuando recibe un tag que no es un bs4.element.tag, lanza un =AssertionError=
- Cuando recibe un tag que no tiene un tag =<span>= con la clase buscada, devuelve un string vacío
- Cuando recibe un tag que tiene el =<span>= pero éste no contiene un =<a>=, devuelve un string vacío
- Cuando recibe un tag que tiene el =<span>= y el =<a>= pero éste último no tiene el atributo =title=, devuelve un string vacío

#+begin_src python :tangle franceinter/podcasts/tests/test_author_from_tag.py
from franceinter.podcasts import author_from_tag
from franceinter.podcasts.tests.examples_author_from_tag import *

def test_author_ok():
    tag = tag_with_author()
    assert ("William Shakespeare" == author_from_tag(tag))

def test_invalid_tag():
    try:
        author_from_tag(5)
    except AssertionError:
        assert True

def test_span_not_found():
    tag = tag_without_span()
    assert ("" == author_from_tag(tag))

def test_a_not_found():
    tag = tag_without_link()
    assert ("" == author_from_tag(tag))

def test_title_not_found():
    tag = tag_without_title()
    assert ("" == author_from_tag(tag))

#+end_src

#+RESULTS:
:results:
None
:end:

***** Obtener el listado de los episodios de un podcast

#+begin_src python
import itertools
import requests
import requests_cache
from franceinter.podcasts import Podcast
from franceinter.episodes import episodes_from_podcast

requests_cache.install_cache()

title = "Sur les épaules de Darwin"
url = "https://www.franceinter.fr/emissions/sur-les-epaules-de-darwin"
author = "Jean-Claude Ameisen"
podcast = Podcast(title, url, author)
episodes = episodes_from_podcast(podcast)
first_five = itertools.islice(episodes, 5)
for episode in first_five:
    print(episode)
    print("\n")

#+end_src

#+RESULTS:
:results:
Episode(title='Les chants des abeilles', date='2019-02-16')


Episode(title='L'Apiculteur aveugle', date='2019-02-09')


Episode(title='Les chants du monde', date='2019-02-02')


Episode(title='Une année dans le monde', date='2019-01-26')


Episode(title='Aux origines du chocolat (8)', date='2019-01-19')


:end:

***** Para cada episodio obtener el título, la fecha, el URL del audio y su duración

#+begin_src python
import itertools
import requests
import requests_cache
from franceinter.podcasts import Podcast
from franceinter.episodes import episodes_from_podcast

requests_cache.install_cache()

title = "Sur les épaules de Darwin"
url = "https://www.franceinter.fr/emissions/sur-les-epaules-de-darwin"
author = "Jean-Claude Ameisen"
podcast = Podcast(title, url, author)
episodes = episodes_from_podcast(podcast)
first = list(itertools.islice(episodes, 5))[0]
print ("   Title: " + first.title)
print ("    Date: " + str(first.date))
print ("     URL: " + first.url)
print ("Duration: " + str(first.duration))

#+end_src

#+RESULTS:
:results:
   Title: Les chants des abeilles
    Date: 2019-02-16
     URL: https://media.radiofrance-podcast.net/podcast09/11549-16.02.2019-ITEMA_21984001-0.mp3
Duration: 3253
:end:

***** Filtrar el listado por una palabra clave

#+begin_src python
import itertools
import requests
import requests_cache
from franceinter.podcasts import Podcast
from franceinter.episodes import (
    episodes_from_podcast, 
    episodes_with_keyword
)

requests_cache.install_cache()

title = "Sur les épaules de Darwin"
url = "https://www.franceinter.fr/emissions/sur-les-epaules-de-darwin"
author = "Jean-Claude Ameisen"
podcast = Podcast(title, url, author)
episodes = episodes_from_podcast(podcast)
choco_episodes = episodes_with_keyword(episodes, "chocolat")
first_five = itertools.islice(choco_episodes, 5)
for episode in first_five:
    print(episode)
    print("\n")

#+end_src

#+RESULTS:
:results:
Episode(title='Aux origines du chocolat (8)', date='2019-01-19')


Episode(title='Aux Origines du Chocolat (7)', date='2019-01-12')


Episode(title='Aux Origines du Chocolat (6)', date='2019-01-05')


Episode(title='Aux origines du chocolat (5)', date='2018-12-15')


Episode(title='Aux origines du chocolat (4)', date='2018-12-08')


:end:

***** Filtrar el listado por año, mes, día o intervalo de fechas

#+begin_src python
import itertools
import requests
import requests_cache
from datetime import date as Date
from franceinter.podcasts import Podcast
from franceinter.episodes import (
    episodes_from_podcast, 
    episodes_between_dates
)

requests_cache.install_cache()

title = "Sur les épaules de Darwin"
url = "https://www.franceinter.fr/emissions/sur-les-epaules-de-darwin"
author = "Jean-Claude Ameisen"
podcast = Podcast(title, url, author)
episodes = episodes_from_podcast(podcast)
first_100 = itertools.islice(episodes, 100)
june_episodes = episodes_between_dates(first_100, Date(2018, 6, 1), Date(2018, 6, 30))
for episode in june_episodes:
    print(episode)
    print("\n")

#+end_src

#+RESULTS:
:results:
Episode(title='Dans les ombres rêveuses', date='2018-06-30')


Episode(title='Le plomb et l'argent (4)', date='2018-06-23')


Episode(title='Le plomb et l'argent (3)', date='2018-06-16')


Episode(title='Le plomb et l'argent (2)', date='2018-06-09')


Episode(title='Le plomb et l'argent', date='2018-06-02')


:end:

***** Run tests

#+begin_src sh
pytest ./franceinter/episodes/tests/test_episodes_from_filename.py
#+end_src

#+RESULTS:
:results:
:end:

** HTML

Vamos a usar cURL para descargar el HTML de las diferentes páginas que necesitamos parsear, así podemos desarrollar y ejecutar los casos de prueba sin tener conexión a Internet. Guardamos los archivos en la carpeta =franceinter/html=.

#+begin_src sh
mkdir -p ./franceinter/html
curl -o ./franceinter/html/podcast-list.html https://www.franceinter.fr/emissions
head -n 1000 ./franceinter/html/podcast-list.html > franceinter/html/podcast-list-short.html
curl -o ./franceinter/html/episode-list.html https://www.franceinter.fr/emissions/sur-les-epaules-de-darwin
curl -o ./franceinter/html/wrong-page.html https://www.pagina12.com.ar
ls -alh ./franceinter/html
#+end_src

#+RESULTS:
:results:
total 10968
drwxr-xr-x  5 martin  staff   160B Feb  8 17:18 .
drwxr-xr-x  7 martin  staff   224B Feb  8 17:18 ..
-rw-r--r--  1 martin  staff   276K Feb  8 17:18 episode-list.html
-rw-r--r--  1 martin  staff   4.1M Feb  8 17:18 podcast-list.html
-rw-r--r--  1 martin  staff    20K Feb  8 17:18 wrong-page.html
:end:

** Implementación de referencia

#+begin_src python :python python-3.6 :results output
from bs4 import BeautifulSoup
from urllib.request import urlopen
import re

def slugify(string):
    return re.sub(r'[-\s]+', '-',
                  (re.sub(r'[^\w\s-]', '',string).strip().lower()))

def linkToDate(link):
    date = ""
    rd = re.search("([0-9]{2})-([a-z]+)-([0-9]{4})$", link)
    if rd:
        date = rd.group(3) + "-" + monthNumber(rd.group(2)) + "-" + rd.group(1)
    return date
        
def monthNumber(month):
    return {
        'janvier': "01",
        'fevrier': "02",
        'mars': "03",
        'avril': "04",
        'mai': "05",
        'juin': "06",
        'juillet': "07",
        'aout': "08",
        'septembre': "09",
        'octobre': "10",
        'novembre': "11",
        'decembre': "12"
    }[month]

    
r = urlopen('https://www.franceinter.fr/emissions/sur-les-epaules-de-darwin?p=2').read()
soup = BeautifulSoup(r, "html.parser")
#print(soup.prettify())
buttons = soup.find_all("button", class_="replay-button")

for button in buttons:
    if "data-url" in button.attrs:
        #print(button.attrs)
        link = button.attrs["data-diffusion-path"]
        date = linkToDate(link)
        filename = date + "-" + slugify(button.attrs["data-diffusion-title"]) + ".mp3"
        #print(filename)
        print("curl -o " + filename + " " + button.attrs["data-url"])
        #print("")

#+end_src

#+RESULTS:
:results:
:end:

